## Gather

In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
patients = pd.read_csv('patients.csv')
treatments = pd.read_csv('treatments.csv')
adverse_reactions = pd.read_csv('adverse_reactions.csv')

## Assess

In [3]:
patients

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
0,1,female,Zoe,Wellish,576 Brown Bear Drive,Rancho California,California,92390.0,United States,951-719-9170ZoeWellish@superrito.com,7/10/1976,121.7,66,19.6
1,2,female,Pamela,Hill,2370 University Hill Road,Armstrong,Illinois,61812.0,United States,PamelaSHill@cuvox.de+1 (217) 569-3204,4/3/1967,118.8,66,19.2
2,3,male,Jae,Debord,1493 Poling Farm Road,York,Nebraska,68467.0,United States,402-363-6804JaeMDebord@gustr.com,2/19/1980,177.8,71,24.8
3,4,male,Liêm,Phan,2335 Webster Street,Woodbridge,NJ,7095.0,United States,PhanBaLiem@jourrapide.com+1 (732) 636-8246,7/26/1951,220.9,70,31.7
4,5,male,Tim,Neudorf,1428 Turkey Pen Lane,Dothan,AL,36303.0,United States,334-515-7487TimNeudorf@cuvox.de,2/18/1928,192.3,27,26.1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
498,499,male,Mustafa,Lindström,2530 Victoria Court,Milton Mills,ME,3852.0,United States,207-477-0579MustafaLindstrom@jourrapide.com,4/10/1959,181.1,72,24.6
499,500,male,Ruman,Bisliev,494 Clarksburg Park Road,Sedona,AZ,86341.0,United States,928-284-4492RumanBisliev@gustr.com,3/26/1948,239.6,70,34.4
500,501,female,Jinke,de Keizer,649 Nutter Street,Overland Park,MO,64110.0,United States,816-223-6007JinkedeKeizer@teleworm.us,1/13/1971,171.2,67,26.8
501,502,female,Chidalu,Onyekaozulu,3652 Boone Crockett Lane,Seattle,WA,98109.0,United States,ChidaluOnyekaozulu@jourrapide.com1 360 443 2060,2/13/1952,176.9,67,27.7
502,503,male,Pat,Gersten,2778 North Avenue,Burr,Nebraska,68324.0,United States,PatrickGersten@rhyta.com402-848-4923,5/3/1954,138.2,71,19.3

In [4]:
treatments

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
0,veronika,jindrová,41u - 48u,-,7.63,7.20,NaN
1,elliot,richardson,-,40u - 45u,7.56,7.09,0.97
2,yukitaka,takenaka,-,39u - 36u,7.68,7.25,NaN
3,skye,gormanston,33u - 36u,-,7.97,7.62,0.35
4,alissa,montez,-,33u - 29u,7.78,7.46,0.32
...,...,...,...,...,...,...,...
275,albina,zetticci,45u - 51u,-,7.93,7.73,0.20
276,john,teichelmann,-,49u - 49u,7.90,7.58,NaN
277,mathea,lillebø,23u - 36u,-,9.04,8.67,0.37
278,vallie,prince,31u - 38u,-,7.64,7.28,0.36
279,samúel,guðbrandsson,53u - 56u,-,8.00,7.64,0.36

In [5]:
adverse_reactions

     given_name     surname           adverse_reaction
0         berta  napolitani  injection site discomfort
1          lena        baer               hypoglycemia
2        joseph         day               hypoglycemia
3        flavia  fiorentino                      cough
4       manouck     wubbels          throat irritation
5       jasmine       sykes               hypoglycemia
6        louise     johnson               hypoglycemia
7       albinca     komavec               hypoglycemia
8           noe      aranda               hypoglycemia
9         sofia   hermansen  injection site discomfort
10        tegan     johnson                   headache
11         abel     yonatan                      cough
12    abdul-nur         isa               hypoglycemia
13         leon      scholz  injection site discomfort
14     gabriele     saenger               hypoglycemia
15       jia li        teng                     nausea
16        jakob    jakobsen               hypoglycemia
17  christopher    woodward                     nausea
18          ole    petersen               hypoglycemia
19       finley    chandler                   headache
20     anenechi       chidi               hypoglycemia
21     miłosław  wiśniewski  injection site discomfort
22        lixue       hsueh  injection site discomfort
23        merci      leroux               hypoglycemia
24         kang         mai  injection site discomfort
25       elliot  richardson               hypoglycemia
26      clinton      miller          throat irritation
27       idalia       moore               hypoglycemia
28       xiuxiu       chang               hypoglycemia
29         alex    crawford               hypoglycemia
30       monika      lončar               hypoglycemia
31       steven         roy                   headache
32      cecilie      nilsen               hypoglycemia
33    krisztina      magyar               hypoglycemia

In [6]:
patients.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 503 entries, 0 to 502
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   patient_id    503 non-null    int64
 1   assigned_sex  503 non-null    object
 2   given_name    503 non-null    object
 3   surname       503 non-null    object
 4   address       491 non-null    object
 5   city          491 non-null    object
 6   state         491 non-null    object
 7   zip_code      491 non-null    float64
 8   country       491 non-null    object
 9   contact       491 non-null    object
 10  birthdate     503 non-null    object
 11  weight        503 non-null    float64
 12  height        503 non-null    int64
 13  bmi           503 non-null    float64
dtypes: float64(3), int64(2), object(9)
memory usage: 55.1+ KB

In [7]:
treatments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 280 entries, 0 to 279
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   given_name    280 non-null    object
 1   surname       280 non-null    object
 2   auralin       280 non-null    object
 3   novodra       280 non-null    object
 4   hba1c_start   280 non-null    float64
 5   hba1c_end     280 non-null    float64
 6   hba1c_change  171 non-null    float64
dtypes: float64(3), object(4)
memory usage: 15.4+ KB

In [8]:
adverse_reactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   given_name        34 non-null     object
 1   surname           34 non-null     object
 2   adverse_reaction  34 non-null     object
dtypes: object(3)
memory usage: 944.0+ bytes

In [9]:
all_columns = pd.Series(list(patients) + list(treatments) + list(adverse_reactions))
all_columns[all_columns.duplicated()]

14    given_name
15       surname
21    given_name
22       surname
dtype: object

In [10]:
list(patients)

['patient_id',
 'assigned_sex',
 'given_name',
 'surname',
 'address',
 'city',
 'state',
 'zip_code',
 'country',
 'contact',
 'birthdate',
 'weight',
 'height',
 'bmi']

In [11]:
list(patients)

['patient_id',
 'assigned_sex',
 'given_name',
 'surname',
 'address',
 'city',
 'state',
 'zip_code',
 'country',
 'contact',
 'birthdate',
 'weight',
 'height',
 'bmi']

In [12]:
patients[patients['address'].isnull()]

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
209,210,female,Lalita,Eldarkhanov,NaN,NaN,NaN,NaN,NaN,NaN,8/14/1950,143.4,62,26.2
219,220,male,Mỹ,Quynh,NaN,NaN,NaN,NaN,NaN,NaN,4/9/1978,237.8,69,35.1
230,231,female,Elisabeth,Knudsen,NaN,NaN,NaN,NaN,NaN,NaN,9/23/1976,165.9,63,29.4
234,235,female,Martina,Tománková,NaN,NaN,NaN,NaN,NaN,NaN,4/7/1936,199.5,65,33.2
242,243,male,John,O'Brian,NaN,NaN,NaN,NaN,NaN,NaN,2/25/1957,205.3,74,26.4
249,250,male,Benjamin,Mehler,NaN,NaN,NaN,NaN,NaN,NaN,10/30/1951,146.5,69,21.6
257,258,male,Jin,Kung,NaN,NaN,NaN,NaN,NaN,NaN,5/17/1995,231.7,69,34.2
264,265,female,Wafiyyah,Asfour,NaN,NaN,NaN,NaN,NaN,NaN,11/3/1989,158.6,63,28.1
269,270,female,Flavia,Fiorentino,NaN,NaN,NaN,NaN,NaN,NaN,10/9/1937,175.2,61,33.1
278,279,female,Generosa,Cabán,NaN,NaN,NaN,NaN,NaN,NaN,12/16/1962,124.3,69,18.4
286,287,male,Lewis,Webb,NaN,NaN,NaN,NaN,NaN,NaN,4/1/1979,155.3,68,23.6
296,297,female,Chỉ,Lâm,NaN,NaN,NaN,NaN,NaN,NaN,5/14/1990,181.1,63,32.1

In [13]:
patients.describe()

       patient_id      zip_code      weight      height         bmi
count  503.000000    491.000000  503.000000  503.000000  503.000000
mean   252.000000  49084.118126  173.434990   66.634195   27.483897
std    145.347859  30265.807442   33.916741    4.411297    5.276438
min      1.000000   1002.000000   48.800000   27.000000   17.100000
25%    126.500000  21920.500000  149.300000   63.000000   23.300000
50%    252.000000  48057.000000  175.300000   67.000000   27.200000
75%    377.500000  75679.000000  199.500000   70.000000   31.750000
max    503.000000  99701.000000  255.900000   79.000000   37.700000

In [14]:
treatments.describe()

       hba1c_start   hba1c_end  hba1c_change
count   280.000000  280.000000    171.000000
mean      7.985929    7.589286      0.546023
std       0.568638    0.569672      0.279555
min       7.500000    7.010000      0.200000
25%       7.660000    7.270000      0.340000
50%       7.800000    7.420000      0.380000
75%       7.970000    7.570000      0.920000
max       9.950000    9.580000      0.990000

In [15]:
patients.sample(5)

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
63,64,male,Yukitaka,Takenaka,1975 Holden Street,San Diego,California,92103.0,United States,619-299-1495YukitakaTakenaka@einrot.com,11/24/1944,193.2,72,26.2
417,418,female,Xiuxiu,Yuan,4277 Mutton Town Road,Redmond,WA,98052.0,United States,360-689-4989XiuxiuYuan@superrito.com,3/8/1943,150.0,66,24.2
474,475,female,Esperanza,Labrosse,1370 Flint Street,Atlanta,GA,30303.0,United States,EsperanzaLabrosse@armyspy.com678-263-3564,10/7/1961,181.5,63,32.1
452,453,female,Fearne,McGregor,1168 Stout Street,Harrisburg,PA,17111.0,United States,717-368-8321FearneMcGregor@superrito.com,6/30/1936,142.1,65,23.6
32,33,female,Một,Phạm,2690 Pin Oak Drive,Long Beach,CA,90815.0,United States,PhamThiBichMot@dayrep.com562-985-4582,1/30/1997,147.6,69,21.8

In [16]:
patients.surname.value_counts()

Doe            6
Jakobsen       3
Taylor         3
Ogochukwu      2
Tucker         2
              ..
Casárez        1
Mata           1
Pospíšil       1
Rukavina       1
Onyekaozulu    1
Name: surname, Length: 466, dtype: int64

In [17]:
patients.address.value_counts()

123 Main Street             6
2778 North Avenue           2
2476 Fulton Street          2
648 Old Dear Lane           2
3094 Oral Lake Road         1
                           ..
1066 Goosetown Drive        1
4291 Patton Lane            1
4643 Reeves Street          1
174 Lost Creek Road         1
3652 Boone Crockett Lane    1
Name: address, Length: 483, dtype: int64

In [18]:
patients[patients.address.duplicated()]

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
29,30,male,Jake,Jakobsen,648 Old Dear Lane,Port Jervis,New York,12771.0,United States,JakobCJakobsen@einrot.com+1 (845) 858-7707,8/1/1985,155.8,67,24.4
219,220,male,Mỹ,Quynh,NaN,NaN,NaN,NaN,NaN,NaN,4/9/1978,237.8,69,35.1
229,230,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
230,231,female,Elisabeth,Knudsen,NaN,NaN,NaN,NaN,NaN,NaN,9/23/1976,165.9,63,29.4
234,235,female,Martina,Tománková,NaN,NaN,NaN,NaN,NaN,NaN,4/7/1936,199.5,65,33.2
237,238,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
242,243,male,John,O'Brian,NaN,NaN,NaN,NaN,NaN,NaN,2/25/1957,205.3,74,26.4
244,245,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
249,250,male,Benjamin,Mehler,NaN,NaN,NaN,NaN,NaN,NaN,10/30/1951,146.5,69,21.6
251,252,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
257,258,male,Jin,Kung,NaN,NaN,NaN,NaN,NaN,NaN,5/17/1995,231.7,69,34.2
264,265,female,Wafiyyah,Asfour,NaN,NaN,NaN,NaN,NaN,NaN,11/3/1989,158.6,63,28.1
269,270,female,Flavia,Fiorentino,NaN,NaN,NaN,NaN,NaN,NaN,10/9/1937,175.2,61,33.1
277,278,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
278,279,female,Generosa,Cabán,NaN,NaN,NaN,NaN,NaN,NaN,12/16/1962,124.3,69,18.4
282,283,female,Sandy,Taylor,2476 Fulton Street,Rainelle,WV,25962.0,United States,304-438-2648SandraCTaylor@dayrep.com,10/23/1960,206.1,64,35.4
286,287,male,Lewis,Webb,NaN,NaN,NaN,NaN,NaN,NaN,4/1/1979,155.3,68,23.6
296,297,female,Chỉ,Lâm,NaN,NaN,NaN,NaN,NaN,NaN,5/14/1990,181.1,63,32.1
502,503,male,Pat,Gersten,2778 North Avenue,Burr,Nebraska,68324.0,United States,PatrickGersten@rhyta.com402-848-4923,5/3/1954,138.2,71,19.3

In [19]:
patients.weight.sort_values()

210     48.8
459    102.1
335    102.7
74     103.2
317    106.0
       ...
144    244.9
61     244.9
283    245.5
118    254.5
485    255.9
Name: weight, Length: 503, dtype: float64

In [20]:
weight_lbs = patients[patients.surname == 'Zaitseva'].weight * 2.20462
height_in = patients[patients.surname == 'Zaitseva'].height
bmi_check = 703 * weight_lbs / (height_in * height_in)
bmi_check

210    19.055827
dtype: float64

In [21]:
patients[patients.surname == 'Zaitseva'].bmi

210    19.1
Name: bmi, dtype: float64

In [22]:
sum(treatments.auralin.isnull())

0

In [23]:
sum(treatments.novodra.isnull())

0

#### Quality
##### `patients` table
- Zip code is a float not a string
- Zip code has four digits sometimes
- Tim Neudorf height is 27 in instead of 72 in
- Full state names sometimes, abbreviations other times
- Dsvid Gustafsson
- Missing demographic information (address - contact columns) ***(can't clean)***
- Erroneous datatypes (assigned sex, state, zip_code, and birthdate columns)
- Multiple phone number formats
- Default John Doe data
- Multiple records for Jakobsen, Gersten, Taylor
- kgs instead of lbs for Zaitseva weight

##### `treatments` table
- Missing HbA1c changes
- The letter 'u' in starting and ending doses for Auralin and Novodra
- Lowercase given names and surnames
- Missing records (280 instead of 350)
- Erroneous datatypes (auralin and novodra columns)
- Inaccurate HbA1c changes (leading 4s mistaken as 9s)
- Nulls represented as dashes (-) in auralin and novodra columns

##### `adverse_reactions` table
- Lowercase given names and surnames

#### Tidiness
- Contact column in `patients` table should be split into phone number and email
- Three variables in two columns in `treatments` table (treatment, start dose and end dose)
- Adverse reaction should be part of the `treatments` table
- Given name and surname columns in `patients` table duplicated in `treatments` and `adverse_reactions` tables

## Clean

In [24]:
patients_clean = patients.copy()
treatments_clean = treatments.copy()
adverse_reactions_clean = adverse_reactions.copy()

### Missing Data

<font color='red'>Complete the following two "Missing Data" **Define, Code, and Test** sequences after watching the *"Address Missing Data First"* video.</font>

#### `treatments`: Missing records (280 instead of 350)

##### Define
<font color = red>*Your definition here. Note: the missing `treatments` records are stored in a file named `treatments_cut.csv`, which you can see in this Jupyter Notebook's dashboard (click the **jupyter** logo in the top lefthand corner of this Notebook). Hint: [documentation page](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.concat.html) for the function used in the solution.*</font>

<font color = green>My Notes.<font><br>
<p>Import the cut treatments into a DataFrame and concatenate it with the original treatments DataFrame.</p>

##### Code

In [25]:
df_treatments_comp = pd.read_csv("treatments_cut.csv")
df_treatments_comp.head()

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
0,jožka,resanovič,22u - 30u,-,7.56,7.22,0.34
1,inunnguaq,heilmann,57u - 67u,-,7.85,7.45,NaN
2,alwin,svensson,36u - 39u,-,7.78,7.34,NaN
3,thể,lương,-,61u - 64u,7.64,7.22,0.92
4,amanda,ribeiro,36u - 44u,-,7.85,7.47,0.38

In [26]:
# Checking if the columns match in both dataframes
treat_cols = pd.DataFrame(pd.Series(list(treatments_clean)+list(df_treatments_comp)))
sorted(list(treat_cols[treat_cols.duplicated()][0])) == sorted(list(treatments_clean.columns))

True

In [27]:
# Concatenating both dataframes
treat_concat = pd.concat([treatments_clean, df_treatments_comp])

In [28]:
#Checking if this concatenation yields duplication
print(f"Returned {treat_concat.duplicated().sum()} duplicated value(s)")

Returned 1 duplicated value(s)

In [29]:
#Checking the duplicated value(s)
treat_concat[treat_concat.duplicated()]

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
136,joseph,day,29u - 36u,-,7.7,7.19,NaN

In [30]:
# The value above will have to be removed in the sequence, in order to guarantee the quality of the data

##### Test

In [31]:
treat_concat.shape

(350, 7)

#### `treatments`: Missing HbA1c changes and Inaccurate HbA1c changes (leading 4s mistaken as 9s)
*Note: the "Inaccurate HbA1c changes (leading 4s mistaken as 9s)" observation, which is an accuracy issue and not a completeness issue, is included in this header because it is also fixed by the cleaning operation that fixes the missing "Missing HbA1c changes" observation. Multiple observations in one **Define, Code, and Test** header occurs multiple times in this notebook.*

##### Define
Recalculate the `hba1c_change` column: `hba1c_start` minus `hba1c_end`.

##### Code

In [32]:
# Your cleaning code here

In [33]:
treatments_clean.hba1c_change = round(treatments_clean.hba1c_start - treatments_clean.hba1c_end, 2)

##### Test

In [34]:
treatments_clean.hba1c_change.head()

0    0.43
1    0.47
2    0.43
3    0.35
4    0.32
Name: hba1c_change, dtype: float64

In [35]:
treatments_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 280 entries, 0 to 279
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   given_name    280 non-null    object
 1   surname       280 non-null    object
 2   auralin       280 non-null    object
 3   novodra       280 non-null    object
 4   hba1c_start   280 non-null    float64
 5   hba1c_end     280 non-null    float64
 6   hba1c_change  280 non-null    float64
dtypes: float64(3), object(4)
memory usage: 15.4+ KB

> Note that all the rows in the `hba1c_change` column are completed now

### Tidiness

<font color='red'>Complete the following four "Tidiness" **Define, Code, and Test** sequences after watching the *"Cleaning for Tidiness"* video.</font>

#### Contact column in `patients` table contains two variables: phone number and email

##### Define
*Your definition here. Hint 1: use regular expressions with pandas' [`str.extract` method](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.str.extract.html). Here is an amazing [regex tutorial](https://regexone.com/). Hint 2: [various phone number regex patterns](https://stackoverflow.com/questions/16699007/regular-expression-to-match-standard-10-digit-phone-number). Hint 3: [email address regex pattern](http://emailregex.com/), which you might need to modify to distinguish the email from the phone number.*

<font color = green> My Sentence </font><br>
> - Creat 2 new columns: `phone_number` and `email_address` <br>
> - Extract both phone and email from the column `contact` 
> - Insert these values in the appropriate column, if exists

##### Code

In [36]:
# Your cleaning code here

In [37]:
patients_clean["contact"] = patients_clean["contact"].str.lower()

In [38]:
patients_clean.head()

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
0,1,female,Zoe,Wellish,576 Brown Bear Drive,Rancho California,California,92390.0,United States,951-719-9170zoewellish@superrito.com,7/10/1976,121.7,66,19.6
1,2,female,Pamela,Hill,2370 University Hill Road,Armstrong,Illinois,61812.0,United States,pamelashill@cuvox.de+1 (217) 569-3204,4/3/1967,118.8,66,19.2
2,3,male,Jae,Debord,1493 Poling Farm Road,York,Nebraska,68467.0,United States,402-363-6804jaemdebord@gustr.com,2/19/1980,177.8,71,24.8
3,4,male,Liêm,Phan,2335 Webster Street,Woodbridge,NJ,7095.0,United States,phanbaliem@jourrapide.com+1 (732) 636-8246,7/26/1951,220.9,70,31.7
4,5,male,Tim,Neudorf,1428 Turkey Pen Lane,Dothan,AL,36303.0,United States,334-515-7487timneudorf@cuvox.de,2/18/1928,192.3,27,26.1

In [39]:
# Extracting the e-mail address from the contact field
patients_clean["email_address"] = patients_clean.contact.str.extract(r"([^0-9]+[a-z]+@+.*\.+[a-z]+)")

In [40]:
# Removing extra spaces before and after the string
patients_clean["email_address"] = patients_clean.email_address.str.strip()

In [41]:
# Creating a new column 'phone' and extracting the email address from the 'contact' field
patients_clean['phone'] = ''
for i in range(patients_clean.shape[0]):
    try:
        patients_clean['phone'].loc[i] = patients_clean.contact.loc[i].replace(patients_clean.email_address.loc[i], '')
    except:
        patients_clean['phone'].loc[i] = ''

C:\Users\iurkl\AppData\Local\Programs\Python\Python37\lib\site-packages\pandas\core\indexing.py:1732: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [42]:
patients_clean['phone'] = patients_clean['phone'].str.replace("(","").str.replace(")","")

C:\Users\iurkl\AppData\Local\Programs\Python\Python37\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  """Entry point for launching an IPython kernel.

In [43]:
patients_clean['phone_number'] = patients_clean['phone'].str.extract(r"(\d{3}[-\s]\d{3}[-\s]\d{4})")

In [44]:
patients_clean['phone_number'] = patients_clean['phone_number'].str.replace('\s', '-').str.strip()

C:\Users\iurkl\AppData\Local\Programs\Python\Python37\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  """Entry point for launching an IPython kernel.

In [45]:
patients_clean["phone_number"] = np.where(~patients_clean["phone_number"].isna(), "+1 " + patients_clean["phone_number"].astype(str),'')

In [46]:
patients_clean = patients_clean.drop(columns=['contact', 'phone']).reset_index(drop = True)

##### Test

In [47]:
patients_clean.head()

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,email_address,phone_number
0,1,female,Zoe,Wellish,576 Brown Bear Drive,Rancho California,California,92390.0,United States,7/10/1976,121.7,66,19.6,zoewellish@superrito.com,+1 951-719-9170
1,2,female,Pamela,Hill,2370 University Hill Road,Armstrong,Illinois,61812.0,United States,4/3/1967,118.8,66,19.2,pamelashill@cuvox.de,+1 217-569-3204
2,3,male,Jae,Debord,1493 Poling Farm Road,York,Nebraska,68467.0,United States,2/19/1980,177.8,71,24.8,jaemdebord@gustr.com,+1 402-363-6804
3,4,male,Liêm,Phan,2335 Webster Street,Woodbridge,NJ,7095.0,United States,7/26/1951,220.9,70,31.7,phanbaliem@jourrapide.com,+1 732-636-8246
4,5,male,Tim,Neudorf,1428 Turkey Pen Lane,Dothan,AL,36303.0,United States,2/18/1928,192.3,27,26.1,timneudorf@cuvox.de,+1 334-515-7487

#### Three variables in two columns in `treatments` table (treatment, start dose and end dose)

##### Define
*Your definition here. Hint: use pandas' [melt function](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.melt.html) and [`str.split()` method](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.str.split.html). Here is an excellent [`melt` tutorial](https://deparkes.co.uk/2016/10/28/reshape-pandas-data-with-melt/).*

<font color = green> My Sentence </font><br>
> - Turn the columns `aurilan` and `novodra` into values of a column called `treatment`<br>
> - Create a column `start_dose` and fill it in with the values befor the `-` in the administrated drug <br>
> - Create a column `end_dose`and fill it in with the values befor the `-` in the administrated drug <br>

##### Code

In [48]:
tc = treatments_clean.copy()
tc.head()

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
0,veronika,jindrová,41u - 48u,-,7.63,7.20,0.43
1,elliot,richardson,-,40u - 45u,7.56,7.09,0.47
2,yukitaka,takenaka,-,39u - 36u,7.68,7.25,0.43
3,skye,gormanston,33u - 36u,-,7.97,7.62,0.35
4,alissa,montez,-,33u - 29u,7.78,7.46,0.32

In [49]:
tc = pd.melt(tc, id_vars = ['given_name', 'surname', 'hba1c_start', 'hba1c_end', 'hba1c_change'], value_vars = ['auralin', 'novodra'],var_name='treatment', value_name="dose", ignore_index=False)

In [50]:
tc[['start_dose', 'end_dose']] = tc.dose.str.split('-', expand = True)

In [51]:
tc = tc.drop(columns=['dose']).sort_index()

In [52]:
tc = tc.query("start_dose != ''")

In [53]:
treatments_clean = tc.copy().reset_index(drop = True)

##### Test

In [54]:
treatments_clean.head()

,given_name,surname,hba1c_start,hba1c_end,hba1c_change,treatment,start_dose,end_dose
0,veronika,jindrová,7.63,7.20,0.43,auralin,41u,48u
1,elliot,richardson,7.56,7.09,0.47,novodra,40u,45u
2,yukitaka,takenaka,7.68,7.25,0.43,novodra,39u,36u
3,skye,gormanston,7.97,7.62,0.35,auralin,33u,36u
4,alissa,montez,7.78,7.46,0.32,novodra,33u,29u

#### Adverse reaction should be part of the `treatments` table

##### Define
*Your definition here. Hint: [tutorial](https://chrisalbon.com/python/pandas_join_merge_dataframe.html) for the function used in the solution.*

<font color = green> My Sentence </font><br>
> - Merge `adverse_reactions` to `treatments`

##### Code

In [55]:
adverse_reactions.head()

  given_name     surname           adverse_reaction
0      berta  napolitani  injection site discomfort
1       lena        baer               hypoglycemia
2     joseph         day               hypoglycemia
3     flavia  fiorentino                      cough
4    manouck     wubbels          throat irritation

In [56]:
treatment_reactions =  treatments_clean.merge(adverse_reactions_clean, on=["given_name", "surname"], how = 'left')

##### Test

In [57]:
treatment_reactions.head()

,given_name,surname,hba1c_start,hba1c_end,hba1c_change,treatment,start_dose,end_dose,adverse_reaction
0,veronika,jindrová,7.63,7.20,0.43,auralin,41u,48u,NaN
1,elliot,richardson,7.56,7.09,0.47,novodra,40u,45u,hypoglycemia
2,yukitaka,takenaka,7.68,7.25,0.43,novodra,39u,36u,NaN
3,skye,gormanston,7.97,7.62,0.35,auralin,33u,36u,NaN
4,alissa,montez,7.78,7.46,0.32,novodra,33u,29u,NaN

#### Given name and surname columns in `patients` table duplicated in `treatments` and `adverse_reactions` tables  and Lowercase given names and surnames

##### Define
*Your definition here. Hint: [tutorial](https://chrisalbon.com/python/pandas_join_merge_dataframe.html) for one function used in the solution and [tutorial](http://erikrood.com/Python_References/dropping_rows_cols_pandas.html) for another function used in the solution.*

<font color = green> My Sentence </font><br>
> - turn the content of `given_name` and `´surname` into lower case <br>
> - add `patient_id` in the `treatments_clean`
> - drop `given_name` and `´surname` from `treatments_clean`
> - move `patient_id` to the first position

##### Code

In [58]:
id_names = patients_clean[['patient_id', 'given_name', 'surname']].copy()
id_names.given_name = id_names.given_name.str.lower()
id_names.surname = id_names.surname.str.lower()
treatments_clean = pd.merge(treatments_clean, id_names, on=['given_name', 'surname'])
treatments_clean = treatments_clean.drop(['given_name', 'surname'], axis=1)

##### Test

In [59]:
treatments_clean.head()

,hba1c_start,hba1c_end,hba1c_change,treatment,start_dose,end_dose,patient_id
0,7.63,7.20,0.43,auralin,41u,48u,225
1,7.56,7.09,0.47,novodra,40u,45u,94
2,7.68,7.25,0.43,novodra,39u,36u,64
3,7.97,7.62,0.35,auralin,33u,36u,242
4,7.78,7.46,0.32,novodra,33u,29u,57

### Quality

<font color='red'>Complete the remaining "Quality" **Define, Code, and Test** sequences after watching the *"Cleaning for Quality"* video.</font>

#### Zip code is a float not a string and Zip code has four digits sometimes

##### Define
*Your definition here. Hint: see the "Data Cleaning Process" page.*

<font color = green> My Sentence </font><br>
> - change the datatype of `zip_code` into string

##### Code

In [60]:
patients_clean.zip_code = patients_clean.zip_code.fillna(0)
patients_clean.zip_code = patients_clean.zip_code.astype(int).astype(str)
patients_clean.zip_code = patients_clean.zip_code.str.replace('0', '')
patients_clean.zip_code = patients_clean.zip_code.str.zfill(5)
patients_clean.zip_code = patients_clean.zip_code.replace('00000', np.nan)

##### Test

In [61]:
patients_clean.zip_code.sort_values()

84     00011
142    00011
316    00012
301    00014
35     00014
       ...
264      NaN
269      NaN
278      NaN
286      NaN
296      NaN
Name: zip_code, Length: 503, dtype: object

#### Tim Neudorf height is 27 in instead of 72 in

##### Define
*Your definition here.*

<font color = green> My Sentence </font><br>
> - Replace the height of the patient to 72

##### Code

In [62]:
patients_clean.query("height < 30")

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,email_address,phone_number
4,5,male,Tim,Neudorf,1428 Turkey Pen Lane,Dothan,AL,03633,United States,2/18/1928,192.3,27,26.1,timneudorf@cuvox.de,+1 334-515-7487

In [63]:
patients_clean.height = patients_clean.height.replace(27,72)

##### Test

In [64]:
patients_clean.query("height < 30").patient_id.count()

0

#### Full state names sometimes, abbreviations other times

##### Define
*Your definition here. Hint: [tutorial](https://chrisalbon.com/python/pandas_apply_operations_to_dataframes.html) for method used in solution.*

<font color = green> My Sentence </font><br>
> - Turn the state names into abbreviations

##### Code

In [65]:
patients_clean.state.value_counts()

California    36
TX            32
New York      25
CA            24
NY            22
MA            22
PA            18
GA            15
Illinois      14
OH            14
OK            13
MI            13
Florida       13
LA            13
NJ            12
VA            11
MS            10
WI            10
IL            10
IN             9
MN             9
FL             9
AL             9
TN             9
WA             8
NC             8
KY             8
MO             7
ID             6
NV             6
KS             6
SC             5
IA             5
CT             5
ME             4
RI             4
Nebraska       4
ND             4
CO             4
AZ             4
AR             4
MD             3
DE             3
WV             3
SD             3
OR             3
NE             2
MT             2
VT             2
DC             2
AK             1
WY             1
NH             1
NM             1
Name: state, dtype: int64

In [66]:
states_abbr = {"California": 'CA', "New York": 'NY', "Illinois": "IL", "Florida": "FL", "Nebraska": "NE" }

In [67]:
for i in range(patients_clean.shape[0]):
    if patients_clean.state[i] in states_abbr.keys():
        patients_clean.state[i] = states_abbr[patients_clean.state[i]]
    else:
        patients_clean.state[i] = patients_clean.state[i]

C:\Users\iurkl\AppData\Local\Programs\Python\Python37\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\iurkl\AppData\Local\Programs\Python\Python37\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

##### Test

In [68]:
patients_clean.state.value_counts()

CA    60
NY    47
TX    32
IL    24
FL    22
MA    22
PA    18
GA    15
OH    14
MI    13
OK    13
LA    13
NJ    12
VA    11
WI    10
MS    10
AL     9
TN     9
IN     9
MN     9
NC     8
KY     8
WA     8
MO     7
NE     6
KS     6
ID     6
NV     6
SC     5
IA     5
CT     5
RI     4
ND     4
AR     4
AZ     4
ME     4
CO     4
MD     3
DE     3
SD     3
WV     3
OR     3
VT     2
MT     2
DC     2
AK     1
NM     1
NH     1
WY     1
Name: state, dtype: int64

#### Dsvid Gustafsson

##### Define
*replace Dsvid Gustafsson by David Gustafsson*

##### Code

In [69]:
patients_clean.given_name = patients_clean.given_name.replace("Dsvid", "David")

##### Test

In [70]:
patients_clean.query("given_name == 'Dsvid'")

Empty DataFrame
Columns: [patient_id, assigned_sex, given_name, surname, address, city, state, zip_code, country, birthdate, weight, height, bmi, email_address, phone_number]
Index: []

#### Erroneous datatypes (assigned sex, state, zip_code, and birthdate columns) and Erroneous datatypes (auralin and novodra columns) and The letter 'u' in starting and ending doses for Auralin and Novodra

##### Define
*Your definition here. Hint: [documentation page](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.astype.html) for one method used in solution, [documentation page](http://pandas.pydata.org/pandas-docs/version/0.20/generated/pandas.to_datetime.html) for one function used in the solution, and [documentation page](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.str.strip.html) for another method used in the solution.*

<font color = green> My Sentence </font><br>

<font color = blue> In patients </font><br>
> - change the datatype of `assigned_sex` and `state` into category
> - change `birthdate` into datetime

<font color = blue> In treatments </font><br>

> - change datetype of the `start_dose` and `end_dose` to int
> - strip the `u` at the end of the dose

##### Code

In [71]:
# Your cleaning code here

In [72]:
# As category
patients_clean.assigned_sex = patients_clean.assigned_sex.astype('category')
patients_clean.state = patients_clean.state.astype('category')

In [73]:
# as date
patients_clean.birthdate = pd.to_datetime(patients_clean.birthdate)

In [74]:
# working with treatments

In [75]:
treatments_clean.treatment = treatments_clean.treatment.astype('category')

In [76]:
treatments_clean.start_dose = treatments_clean.start_dose.str.strip().str.strip(to_strip='u').astype(int)
treatments_clean.end_dose = treatments_clean.end_dose.str.strip().str.strip(to_strip='u').astype(int)

##### Test

In [77]:
treatments_clean.dtypes

hba1c_start      float64
hba1c_end        float64
hba1c_change     float64
treatment       category
start_dose         int32
end_dose           int32
patient_id         int64
dtype: object

In [78]:
treatments_clean

,hba1c_start,hba1c_end,hba1c_change,treatment,start_dose,end_dose,patient_id
0,7.63,7.20,0.43,auralin,41,48,225
1,7.56,7.09,0.47,novodra,40,45,94
2,7.68,7.25,0.43,novodra,39,36,64
3,7.97,7.62,0.35,auralin,33,36,242
4,7.78,7.46,0.32,novodra,33,29,57
...,...,...,...,...,...,...,...
274,7.93,7.73,0.20,auralin,45,51,197
275,7.90,7.58,0.32,novodra,49,49,141
276,9.04,8.67,0.37,auralin,23,36,308
277,7.64,7.28,0.36,auralin,31,38,388
278,8.00,7.64,0.36,auralin,53,56,22

In [79]:
patients_clean.dtypes

patient_id                int64
assigned_sex           category
given_name               object
surname                  object
address                  object
city                     object
state                  category
zip_code                 object
country                  object
birthdate        datetime64[ns]
weight                  float64
height                    int64
bmi                     float64
email_address            object
phone_number             object
dtype: object

#### Multiple phone number formats

##### Define
*Your definition here. Hint: helpful [Stack Overflow answer](https://stackoverflow.com/a/123681).*

<font color = green> My Sentence </font><br>

> - Remove all special charecters and return the phone number as a single string composed by the country code + 10 numbers

##### Code

In [80]:
patients_clean["phone_number"] = patients_clean.phone_number.str.findall("\d")
patients_clean["phone_number"] = patients_clean["phone_number"].str.join("")

##### Test

In [81]:
patients_clean.head()

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,email_address,phone_number
0,1,female,Zoe,Wellish,576 Brown Bear Drive,Rancho California,CA,09239,United States,1976-07-10,121.7,66,19.6,zoewellish@superrito.com,19517199170
1,2,female,Pamela,Hill,2370 University Hill Road,Armstrong,IL,61812,United States,1967-04-03,118.8,66,19.2,pamelashill@cuvox.de,12175693204
2,3,male,Jae,Debord,1493 Poling Farm Road,York,NE,68467,United States,1980-02-19,177.8,71,24.8,jaemdebord@gustr.com,14023636804
3,4,male,Liêm,Phan,2335 Webster Street,Woodbridge,NJ,00795,United States,1951-07-26,220.9,70,31.7,phanbaliem@jourrapide.com,17326368246
4,5,male,Tim,Neudorf,1428 Turkey Pen Lane,Dothan,AL,03633,United States,1928-02-18,192.3,72,26.1,timneudorf@cuvox.de,13345157487

#### Default John Doe data

##### Define
*Your definition here. Recall that it is assumed that the data that this John Doe data displaced is not recoverable.*

<font color = green> My Sentence </font><br>

> - Remove `John Doe` from the `patients table`

##### Code

In [82]:
patients_clean = patients_clean.query("not(given_name == 'John' & surname == 'Doe')")

##### Test

In [89]:
patients_clean.query("(given_name == 'John' & surname == 'Doe')")

Empty DataFrame
Columns: [patient_id, assigned_sex, given_name, surname, address, city, state, zip_code, country, birthdate, weight, height, bmi, email_address, phone_number]
Index: []

#### Multiple records for Jakobsen, Gersten, Taylor

##### Define
*Your definition here.*

##### Code

In [94]:
suspected_names = ['Jakobsen', 'Gersten', 'Taylor']
suspected_patients = patients_clean.query("surname == @suspected_names").sort_values(by=['surname'])
suspected_patients

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,email_address,phone_number
97,98,male,Patrick,Gersten,2778 North Avenue,Burr,NE,68324,United States,1954-05-03,138.2,71,19.3,patrickgersten@rhyta.com,14028484923
502,503,male,Pat,Gersten,2778 North Avenue,Burr,NE,68324,United States,1954-05-03,138.2,71,19.3,patrickgersten@rhyta.com,14028484923
24,25,male,Jakob,Jakobsen,648 Old Dear Lane,Port Jervis,NY,12771,United States,1985-08-01,155.8,67,24.4,jakobcjakobsen@einrot.com,18458587707
29,30,male,Jake,Jakobsen,648 Old Dear Lane,Port Jervis,NY,12771,United States,1985-08-01,155.8,67,24.4,jakobcjakobsen@einrot.com,18458587707
432,433,female,Karen,Jakobsen,1690 Fannie Street,Houston,TX,00772,United States,1962-11-25,185.2,67,29.0,karenjakobsen@jourrapide.com,19792030438
131,132,female,Sandra,Taylor,2476 Fulton Street,Rainelle,WV,25962,United States,1960-10-23,206.1,64,35.4,sandractaylor@dayrep.com,13044382648
282,283,female,Sandy,Taylor,2476 Fulton Street,Rainelle,WV,25962,United States,1960-10-23,206.1,64,35.4,sandractaylor@dayrep.com,13044382648
426,427,male,Rogelio,Taylor,4064 Marigold Lane,Miami,FL,33179,United States,1992-09-02,186.6,69,27.6,rogeliojtaylor@teleworm.us,13054346299

<font color = orange> Disclosure </font><br>

> Notice that, even though the given name changes, the email address and personal data are the same.<br>
So, we will check duplication over email and date of birth and keep the first value of each repeated patient

In [104]:
repeated_patients = suspected_patients[suspected_patients.duplicated(subset = ["email_address", "birthdate" ])]
repeated_patients

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,email_address,phone_number
502,503,male,Pat,Gersten,2778 North Avenue,Burr,NE,68324,United States,1954-05-03,138.2,71,19.3,patrickgersten@rhyta.com,14028484923
29,30,male,Jake,Jakobsen,648 Old Dear Lane,Port Jervis,NY,12771,United States,1985-08-01,155.8,67,24.4,jakobcjakobsen@einrot.com,18458587707
282,283,female,Sandy,Taylor,2476 Fulton Street,Rainelle,WV,25962,United States,1960-10-23,206.1,64,35.4,sandractaylor@dayrep.com,13044382648

In [100]:
# To guarantee that the patient ids don't repeat, because this will be the field we will use to discard the patients
suspected_patients.patient_id.duplicated().sum()

0

In [109]:
patients_to_discard = list(repeated_patients.patient_id)
patients_to_discard

[503, 30, 283]

In [107]:
patients_clean.shape

(497, 15)

In [112]:
patients_clean = patients_clean.query("patient_id != @patients_to_discard")

##### Test

In [113]:
patients_clean.shape

(494, 15)

In [114]:
patients_clean.query("surname == @suspected_names").sort_values(by=['surname'])

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,email_address,phone_number
97,98,male,Patrick,Gersten,2778 North Avenue,Burr,NE,68324,United States,1954-05-03,138.2,71,19.3,patrickgersten@rhyta.com,14028484923
24,25,male,Jakob,Jakobsen,648 Old Dear Lane,Port Jervis,NY,12771,United States,1985-08-01,155.8,67,24.4,jakobcjakobsen@einrot.com,18458587707
432,433,female,Karen,Jakobsen,1690 Fannie Street,Houston,TX,00772,United States,1962-11-25,185.2,67,29.0,karenjakobsen@jourrapide.com,19792030438
131,132,female,Sandra,Taylor,2476 Fulton Street,Rainelle,WV,25962,United States,1960-10-23,206.1,64,35.4,sandractaylor@dayrep.com,13044382648
426,427,male,Rogelio,Taylor,4064 Marigold Lane,Miami,FL,33179,United States,1992-09-02,186.6,69,27.6,rogeliojtaylor@teleworm.us,13054346299

#### kgs instead of lbs for Zaitseva weight

##### Define
*Your definition here.*

<font color = green> My Sentence </font><br>

> - Transform `Zaitseva`´weight into lb
> - Check if all bmis correspond to the following formula:<br>
> $703 * weight (lbs) / [height (in)]^2$

##### Code

In [116]:
patients_clean.query("surname == 'Zaitseva'")

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,email_address,phone_number
210,211,female,Camilla,Zaitseva,4689 Briarhill Lane,Wooster,OH,44691,United States,1938-11-26,48.8,63,19.1,camillazaitseva@superrito.com,13302022145

> Notice that the the patient bmi doesn't correspond to the application of the bmi formula. Let's if we have more

In [126]:
pp = patients_clean.copy()

In [128]:
def calc_bmi(x):
    bmi = 703 *x['weight'] / (x['height'])**2
    return bmi

In [131]:
pp["bmi_calculated"] =  pp.apply(calc_bmi, axis = 1).round(1)

In [133]:
pp["bmi_diff"] = pp.bmi - pp.bmi_calculated

In [136]:
pp.query("bmi_diff !=0")

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,email_address,phone_number,bmi_calculated,bmi_diff
210,211,female,Camilla,Zaitseva,4689 Briarhill Lane,Wooster,OH,44691,United States,1938-11-26,48.8,63,19.1,camillazaitseva@superrito.com,13302022145,8.6,10.5

> Notice that only one patient is incorrect. So, we will assume that the weight is incorrect and we will switch it to lb multiplying by 2.20462

In [143]:
patients_clean.weight[210] = (round(patients_clean.weight[210]*2.20462, 2))

C:\Users\iurkl\AppData\Local\Programs\Python\Python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

##### Test

In [146]:
patients_clean.loc[210]

patient_id                                 211
assigned_sex                            female
given_name                             Camilla
surname                               Zaitseva
address                    4689 Briarhill Lane
city                                   Wooster
state                                       OH
zip_code                                 44691
country                          United States
birthdate                  1938-11-26 00:00:00
weight                                  107.59
height                                      63
bmi                                       19.1
email_address    camillazaitseva@superrito.com
phone_number                       13302022145
Name: 210, dtype: object